# RibbonItem Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItem Members
RibbonItem Class Methods Properties See Also
---
The RibbonItem type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetContextualHelp | Gets the contextual help bound with this control. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetContextualHelp | Sets the contextual help bound with this button. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Enabled | Gets or sets a value indicating whether the item is enabled. |
| ItemText | Gets or sets the text displayed on the item. |
| ItemType | Gets the item type. |
| LongDescription | Long description of the command tooltip |
| Name | The name of the item. |
| ToolTip | The description that appears as a ToolTip for the item. |
| ToolTipImage | The image to show as a part of the button extended tooltip |
| Visible | Gets or sets a value indicating whether the item is visible. |

# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace